{
  "posts": [
    {
      "id": 1,
      "title": "Global Tech Ai opens a new office in Ukraine ",
      "author": "Global Insight News",
      "category": "Technology",
      "content": " Global Tech AI has opened a new office in Ukraine, reinforcing its commitment to innovation and tapping into the country’s strong tech talent. The office will focus on AI research, development, and partnerships to boost product innovation and support the local digital economy. This move strengthens Global Tech AI’s global leadership in artificial intelligence.    ",
      "imageUrl": "https://images.unsplash.com/photo-1504384308090-c894fdcc538d?q=80&w=870&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D ",
      "date": "2025-06-21"
    },
    {
      "id": 2,
      "title": " Why the WHO Recomends Meditation as a Powerful Tool for  Health",
      "author": "Global Insight News",
      "category": "Health",
      "content": "The World Health Organization (WHO) recognizes meditation as a powerful way to boost mental and physical health. It helps reduce stress, anxiety, and depression while promoting emotional balance and clarity.Meditation also improves physical health by lowering blood pressure, strengthening immunity, improving sleep, and supporting heart health. That’s why WHO includes it in its mental wellness strategies.In today’s busy world, meditation is more than a spiritual practice—it’s a science-backed tool for better living. Just a few minutes a day can make a big difference. Start today—your mind and body will thank you. ",
      "imageUrl": "https://images.unsplash.com/photo-1506126613408-eca07ce68773?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8N3x8aGVhbHRofGVufDB8fDB8fHww",
      "date": "2025-06-21"
    },
    {
      "title": "Big Blow to Kenyans as VAT increases to 20%",
      "author": "Global Insights News",
      "category": "Economy",
      "imageUrl": "https://media.istockphoto.com/id/2165462299/photo/woman-shopping-at-a-convenience-store-and-checking-her-receipt.webp?a=1&b=1&s=612x612&w=0&k=20&c=-uU4ucwnLidAij8owVSlCBnJNs5fY7XDKqUBY6iBzX8=",
      "content": "Kenyans are facing a fresh financial hit after the government raised VAT from 16% to 20% in the 2025 Finance Bill. The hike means higher prices for basic goods and services, deepening the cost of living crisis for many households.\n\nSmall businesses fear reduced sales, while citizens worry about tighter budgets. The government says the move is needed to boost revenue, but critics argue it will hurt ordinary Kenyans the most.\n\n",
      "date": "2025-06-22T19:28:39.808Z",
      "id": 3
    },
    {
      "title": "🇺🇸 Could Obama Jump Back In?",
      "author": "Global Insights",
      "category": "politics",
      "imageUrl": "https://images.unsplash.com/photo-1541872703-74c5e44368f9?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTJ8fHBvbGl0aWNzfGVufDB8fDB8fHww",
      "content": "Recently, a flurry of chatter hit social media when former President Donald Trump mused — albeit jokingly, perhaps — about pursuing a third presidential term. That prompted the hashtag #Obama2028 to trend on X, with fans playfully suggesting that if the rules changed, Barack Obama could return to politics in 2028 — liked more than a Trump rerun",
      "date": "2025-06-23T08:46:17.132Z",
      "id": 4
    }
  ]
}
